Repository: andrelucassvt/CleanMacForFlutter
Catalog: CleanMacForFlutters/Resources/Localization/*.lproj/Localizable.strings
Languages: pt_br

# home.select_folders
source: Select folders
pt_br: Selecionar pastas

# home.empty_folders_message
source: Select one or more folders to display.
pt_br: Selecione uma ou mais pastas para exibir.

# home.support
source: Support
pt_br: Apoiar

# fda.required_title
source: Full Disk Access Required
pt_br: Acesso total ao disco necessário

# fda.required_description
source: For the app to work correctly and be able to clean project folders, grant Full Disk Access in System Settings.
pt_br: Para que o app funcione corretamente e consiga limpar as pastas dos projetos, conceda Acesso total ao disco nas Configurações do sistema.

# fda.open_settings
source: Open Privacy Settings
pt_br: Abrir Configurações de Privacidade

# fda.try_again
source: Try again
pt_br: Tentar novamente

# fda.checking_permissions
source: Checking permissions…
pt_br: Verificando permissões…

# fda.instructions
source: Path: System Settings > Privacy & Security > Full Disk Access Add your app to the list and mark it as active.
pt_br: Caminho: Ajustes do sistema > Privacidade e Segurança > Acesso total ao disco Adicione seu app à lista e marque como ativo.

# commands.executing
source: Executing commands...
pt_br: Executando comandos...

# commands.processing_folder
source: Processing: %@
pt_br: Processando: %@

# clean.no.activated
source: No activated folders to clean
pt_br: Sem pasta para limpar

# alert.error
source: Error
pt_br: Erro

# alert.success
source: Success
pt_br: Sucesso

# icon.folder
source: folder
pt_br: pasta

# icon.lock
source: lock
pt_br: bloqueio

# clean.completed.title
source: Cleaning completed!
pt_br: Limpeza concluída!

# clean.completed.summary
source: ✅ Folders deleted: %d
pt_br: ✅ Pastas deletadas: %d

# clean.completed.space
source: 💾 Space freed: %@
pt_br: 💾 Espaço liberado: %@

# clean.completed.warnings
source: ⚠️ Warnings: %d
pt_br: ⚠️ Avisos: %d

# clean.none.deleted.errors
source: No folders were deleted, but %d errors occurred.
pt_br: Nenhuma pasta foi deletada, mas ocorreram %d erros.

# clean.nothing.found
source: No folders to clean were found.
pt_br: Nenhuma pasta para limpar foi encontrada.
